// List of valid majors/faculties at CMU
export const MAJORS = [
  'วิทยาลัยศิลปะ สื่อ และเทคโนโลยี',
  'คณะการสื่อสารมวลชน',
  'คณะเกษตรศาสตร์',
  'คณะทันตแพทยศาสตร์',
  'คณะเทคนิคการแพทย์',
  'คณะนิติศาสตร์',
  'คณะบริหารธุรกิจ',
  'คณะพยาบาลศาสตร์',
  'คณะแพทยศาสตร์',
  'คณะเภสัชศาสตร์',
  'คณะมนุษยศาสตร์',
  'คณะรัฐศาสตร์และรัฐประศาสนศาสตร์',
  'คณะวิจิตรศิลป์',
  'คณะวิทยาศาสตร์',
  'คณะวิศวกรรมศาสตร์',
  'คณะศึกษาศาสตร์',
  'คณะเศรษฐศาสตร์',
  'คณะสถาปัตยกรรมศาสตร์',
  'คณะสังคมศาสตร์',
  'คณะสัตวแพทยศาสตร์',
  'คณะสาธารณสุขศาสตร์',
  'คณะอุตสาหกรรมเกษตร',
  'วิทยาลัยนานาชาตินวัตกรรมดิจิทัล',
  'วิทยาลัยพหุวิทยาการและสหวิทยาการ',
  'สถาบันนโยบายสาธารณะ',
  'สถาบันวิศวกรรมชีวการแพทย์',
] as const;

export type Major = typeof MAJORS[number];

